[
  {
    "id": 1,
    "slug": "social-media-app",
    "title": "Connect & Share: A social platform where users can create profiles, connect with friends, and exchange messages in real-time.",
    "tech": ["ReactJS", "Tailwind CSS", "Firebase", "Redux", "Firebase Auth"],
    "image": "/images/portfolio/mychat3.png",
    "banner_image": "/images/portfolio/mychat3.png",
    "client": "Practice Project",
    "categories": ["website", "frontend"],
    "github": "https://github.com/sohanthink/mychat",
    "website": "https://sohanschat.vercel.app/",
    "login": {
      "admin": {
        "email": "sohaneftekhar@gmail.com",
        "password": "123456",
        "description": "Admin access with full permissions"
      },
      "user": {
        "email": "user@demo.com",
        "password": "user123",
        "description": "Regular user account"
      }
    },
    "details": {
      "description": "This project is a social media application built with ReactJS, featuring real-time chatting capabilities. It includes user authentication, post creation, and a dynamic feed for user interactions. The app is designed to be responsive and utilizes Redux for state management.",
      "keyFeatures": {
        "features": [
          "<strong>User Authentication:</strong> Secure sign-up and login with form validation.",
          "<strong>Post Creation:</strong> Users can create, edit, and delete text-based or image-based posts.",
          "<strong>Feed & Interaction:</strong> A dynamic feed where users can post anything and view others' posts.",
          "<strong>State Management:</strong> Redux is used for efficient and predictable state management.",
          "<strong>Firebase Realtime Database:</strong> Real-time data synchronization for chat messages and posts."
        ],
        "image": "/images/portfolio/mychat.png"
      },
      "technologyStack": [
        "<strong>Frontend:</strong> React, Tailwind CSS, Redux",
        "<strong>Database:</strong> Firebase Realtime Database",
        "<strong>Tools & Libraries:</strong> Axios, React Router, Vite"
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Building a real-time feed for seamless user interactions.",
          "solution": "Leveraged Redux for managing application state efficiently."
        },
        {
          "challenge": "Implementing real-time chatting features for single and group chats.",
          "solution": "Integrated Firebase Realtime Database to handle real-time messaging and used Redux to manage chat state efficiently."
        }
      ],
      "visuals": [
        "/images/portfolio/mychat2.png",
        "/images/portfolio/mychat1.png",
        "/images/portfolio/mychat3.png"
      ],
      "developmentInsights": {
        "whatILearned": "This project deepened my understanding of Redux, state management, real-time chatting, single or group messaging, and posting functionalities. I also improved my ability to design intuitive user interfaces.",
        "timeframe": "Completed in approximately 4 months, balancing frontend and Firebase development."
      }
    }
  },
  {
    "id": 2,
    "slug": "embedded-expert",
    "title": "A Course selling website offering international hardwere programming courses",
    "tech": [
      "NextJS",
      "Tailwind CSS",
      "MySql",
      "Sequelize-orm",
      "AcertinityUI",
      "SwiperJS"
    ],
    "image": "/images/portfolio/embedded1.png",
    "banner_image": "/images/portfolio/embedded1.png",
    "client": "Ninsaw Gbati",
    "categories": ["website", "frontend", "fullstack"],
    "github": "https://github.com/sohanthink/embeddedExpert",
    "website": "https://embeddedexpert.onrender.com/",
    "details": {
      "description": "This project is a hardware programming course showcase website built with Next.js, Tailwind CSS and Acertinity UI. It features a modern, responsive design that displays various hardware programming courses with their detailed descriptions and pricing. Visitors can browse through the course catalog and when ready to purchase, they are redirected to the original course platform. The website utilizes Next.js for optimal performance and SEO, while Tailwind CSS and Acertinity UI provide a sleek, professional user interface.",
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, AcertinityUI & Tailwind CSS.",
        "<strong>Backend:</strong> NextJS Server.",
        "<strong>Database:</strong> MySQL with Sequelize ORM."
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Managing course data efficiently with a robust database solution.",
          "solution": "Implemented MySQL with Sequelize ORM to handle complex queries and ensure data integrity."
        }
      ],
      "visuals": [
        "/images/portfolio/embedded2.png",
        "/images/portfolio/embedded3.png",
        "/images/portfolio/embedded4.png"
      ],
      "developmentInsights": {
        "whatILearned": "This project deepened my understanding of Sequelize ORM with MySQL and efficient database management. I also improved my ability to design intuitive user interfaces and create responsive web applications.",
        "timeframe": "Completed in approximately 1.5 months, balancing frontend and backend development."
      }
    }
  },
  {
    "id": 3,
    "slug": "nursingcare",
    "title": "A nursing care management application for patient and employee administration",
    "tech": ["nextjs", "tailwindcss", "shadcn/ui", "axios", "momentjs", "zod"],
    "image": "/images/portfolio/nursing1.png",
    "banner_image": "/images/portfolio/nursing1.png",
    "client": "Personal Project",
    "categories": ["frontend"],
    "website": "https://nursingcare.vercel.app/",
    "login": {
      "admin": {
        "email": "sohaneftekhar@gmail.com",
        "password": "123456",
        "description": "Admin Login : https://nursingcare.vercel.app/auth/admin"
      },
      "employee": {
        "email": "employee3@gmail.com",
        "password": "123456",
        "description": "Employee Login : https://nursingcare.vercel.app/auth/admin"
      }
    },

    "details": {
      "description": "A comprehensive nursing care management platform that enables healthcare administrators to efficiently manage employees, patients, and care services. The system features robust user profile management, employee-patient assignment capabilities, booking and appointment scheduling, document management for medical papers, customizable care plan creation, and integrated form management. This streamlined solution helps nursing facilities improve their operational efficiency and deliver better patient care through organized administration.",
      "keyFeatures": {
        "features": [
          "<strong>User Profile Management:</strong> Comprehensive system for managing employee and patient profiles.",
          "<strong>Employee-Patient Assignment:</strong> Efficient assignment and tracking of care providers to patients.",
          "<strong>Booking & Scheduling:</strong> Appointment scheduling and management system.",
          "<strong>Document Management:</strong> Secure storage and handling of medical documents and papers.",
          "<strong>Care Plan Creation:</strong> Customizable care plans for individual patients.",
          "<strong>Form Management:</strong> Integrated system for managing medical and administrative forms."
        ],
        "image": ""
      },
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, TailwindCSS, Shadcn/UI, Axios, MomentJS, Zod",
        "<strong>Backend:</strong> NodeJS, ExpressJS, MongoDB, Mongoose"
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Implementing dynamic form creation and location tracking features.",
          "solution": "Developed a flexible form builder system with custom validation and integrated real-time location services for accurate tracking and updates. Also implemented a robust appointment scheduling system with conflict detection."
        }
      ],
      "visuals": [
        "/images/portfolio/nursing2.png",
        "/images/portfolio/nursing3.png",
        "/images/portfolio/nursing4.png",
        "/images/portfolio/nursing5.png",
        "/images/portfolio/nursing6.png"
      ],
      "developmentInsights": {
        "whatILearned": "Gained extensive experience in backend optimization techniques and complex MongoDB database integration, including implementing efficient queries, indexing strategies, and handling complex data relationships.",
        "timeframe": "Completed in approximately 6 months, including testing and deployment."
      }
    }
  },
  {
    "id": 4,
    "slug": "Pool",
    "title": "A platform for sharing and booking private pools, tennis courts and pickleball courts",
    "tech": [
      "NextJS",
      "TypeScript",
      "Prisma",
      "PostgreSQL",
      "Stripe",
      "Tailwind CSS"
    ],
    "image": "/images/portfolio/pool1.png",
    "banner_image": "/images/portfolio/pool1.png",
    "client": "Joe",
    "categories": ["website", "frontend", "backend", "fullstack"],
    "website": "https://pool-wgw9.onrender.com/",
    "details": {
      "description": "A platform that allows users to list their private pools, tennis courts, and pickleball courts, generate shareable booking links, and manage reservations seamlessly.",
      "keyFeatures": {
        "features": [
          "<strong>Facility Management:</strong> Easy interface to add and manage pools, tennis courts, and pickleball courts.",
          "<strong>Booking Link Generation:</strong> Create unique, shareable links for each facility listing.",
          "<strong>Availability Calendar:</strong> Interactive calendar showing available time slots and managing bookings.",
          "<strong>Reservation System:</strong> Simple booking process for guests using shared links."
        ],
        "image": ""
      },
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, ShadCn, Tailwind CSS",
        "<strong>Backend:</strong> NextJS API Routes,GoogleOauth",
        "<strong>Database:</strong> MongoDB"
      ],
      "visuals": [
        "/images/portfolio/pool2.png",
        "/images/portfolio/pool3.png",
        "/images/portfolio/pool4.png",
        "/images/portfolio/pool5.png"
      ]
    }
  }
]
