[
  {
    "id": 1,
    "slug": "businessventure",
    "title": "A comprehensive business consulting platform for entrepreneurs and business owners",
    "tech": [
      "NextJS",
      "Next API",
      "Tailwind CSS",
      "framer-motion",
      "VPS",
      "Nginx",
      "PM2"
    ],
    "image": "/images/portfolio/businessventure1.png",
    "banner_image": "/images/portfolio/businessventure1.png",
    "client": "Canadian Client",
    "categories": ["website"],
    "website": "https://nlbusiness.vercel.app/",
    "details": {
      "description": "A comprehensive business consulting platform similar to Joorney.com, designed to help entrepreneurs and business owners access professional consulting services. This production-ready application provides a marketplace where business consultants can offer their expertise and clients can find the right consultant for their specific needs. The platform features advanced search capabilities, consultant profiles, booking systems, and secure payment processing, all hosted on a custom VPS server with professional deployment practices.",
      "keyFeatures": {
        "features": [
          "<strong>Consultant Marketplace:</strong> Platform for business consultants to showcase their expertise and services.",
          "<strong>Advanced Search & Filtering:</strong> Sophisticated search system to help clients find the right consultant.",
          "<strong>Profile Management:</strong> Comprehensive consultant profiles with portfolios, reviews, and certifications.",
          "<strong>Booking & Scheduling:</strong> Integrated appointment booking system with calendar management.",
          "<strong>Payment Processing:</strong> Secure payment gateway for consulting services and transactions.",
          "<strong>Review & Rating System:</strong> Client feedback and rating system for consultant quality assurance."
        ],
        "image": ""
      },
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, TypeScript, Tailwind CSS",
        "<strong>Backend:</strong> NextJS API Routes, Server-side Rendering",
        "<strong>Hosting:</strong> VPS Server with Nginx reverse proxy",
        "<strong>Process Management:</strong> PM2 for application process management",
        "<strong>Deployment:</strong> Custom VPS deployment with professional server configuration"
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Setting up and configuring a production VPS server with proper security and performance optimization.",
          "solution": "Implemented Nginx as a reverse proxy with SSL certificates, configured PM2 for process management, and set up proper server security measures including firewall configuration and automated backups."
        },
        {
          "challenge": "Building a scalable marketplace platform with complex user interactions and payment processing.",
          "solution": "Developed a robust NextJS application with optimized API routes, implemented efficient database queries, and integrated secure payment processing with proper error handling and validation."
        }
      ],
      "visuals": [
        "/images/portfolio/businessventure1.png",
        "/images/portfolio/businessventure2.png",
        "/images/portfolio/businessventure3.png",
        "/images/portfolio/businessventure4.png"
      ],
      "developmentInsights": {
        "whatILearned": "Gained extensive experience in VPS server management, Nginx configuration, PM2 process management, and production deployment strategies. Learned about server security, SSL certificate management, and performance optimization techniques. Also developed deep understanding of marketplace platform architecture and business consulting industry requirements.",
        "timeframe": "Completed in approximately 3 months, including server setup, development, and deployment.",
        "serverManagement": "Mastered VPS server administration including Nginx reverse proxy setup, PM2 process management, SSL configuration, and server security best practices for production applications."
      }
    }
  },
  {
    "id": 2,
    "slug": "Pool",
    "title": "A platform for sharing and booking private pools, tennis courts and pickleball courts",
    "tech": [
      "NextJS",
      "Tailwind CSS",
      "NextAPI",
      "MongoDB",
      "Mongoose",
      "Google Oauth"
    ],
    "image": "/images/portfolio/pool1.png",
    "banner_image": "/images/portfolio/pool1.png",
    "client": "Joe",
    "categories": ["website", "frontend", "backend", "fullstack"],
    "website": "https://pool-wgw9.onrender.com/",
    "details": {
      "description": "A platform that allows users to list their private pools, tennis courts, and pickleball courts, generate shareable booking links, and manage reservations seamlessly.",
      "keyFeatures": {
        "features": [
          "<strong>Facility Management:</strong> Easy interface to add and manage pools, tennis courts, and pickleball courts.",
          "<strong>Booking Link Generation:</strong> Create unique, shareable links for each facility listing.",
          "<strong>Availability Calendar:</strong> Interactive calendar showing available time slots and managing bookings.",
          "<strong>Reservation System:</strong> Simple booking process for guests using shared links."
        ],
        "image": ""
      },
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, ShadCn, Tailwind CSS",
        "<strong>Backend:</strong> NextJS API Routes,GoogleOauth",
        "<strong>Database:</strong> MongoDB"
      ],
      "visuals": [
        "/images/portfolio/pool2.png",
        "/images/portfolio/pool3.png",
        "/images/portfolio/pool4.png",
        "/images/portfolio/pool5.png"
      ]
    }
  },
  {
    "id": 3,
    "slug": "embedded-expert",
    "title": "A Course selling website offering international hardwere programming courses",
    "tech": [
      "NextJS",
      "Tailwind CSS",
      "MySql",
      "Sequelize-orm",
      "AcertinityUI",
      "SwiperJS"
    ],
    "image": "/images/portfolio/embedded1.png",
    "banner_image": "/images/portfolio/embedded1.png",
    "client": "Ninsaw Gbati",
    "categories": ["website", "frontend", "fullstack"],
    "github": "https://github.com/sohanthink/embeddedExpert",
    "website": "https://embedded-expert.vercel.app/",
    "details": {
      "description": "This project is a hardware programming course showcase website built with Next.js, Tailwind CSS and Acertinity UI. It features a modern, responsive design that displays various hardware programming courses with their detailed descriptions and pricing. Visitors can browse through the course catalog and when ready to purchase, they are redirected to the original course platform. The website utilizes Next.js for optimal performance and SEO, while Tailwind CSS and Acertinity UI provide a sleek, professional user interface.",
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, AcertinityUI & Tailwind CSS.",
        "<strong>Backend:</strong> NextJS Server.",
        "<strong>Database:</strong> MySQL with Sequelize ORM."
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Managing course data efficiently with a robust database solution.",
          "solution": "Implemented MySQL with Sequelize ORM to handle complex queries and ensure data integrity."
        }
      ],
      "visuals": [
        "/images/portfolio/embedded2.png",
        "/images/portfolio/embedded3.png",
        "/images/portfolio/embedded4.png"
      ],
      "developmentInsights": {
        "whatILearned": "This project deepened my understanding of Sequelize ORM with MySQL and efficient database management. I also improved my ability to design intuitive user interfaces and create responsive web applications.",
        "timeframe": "Completed in approximately 1.5 months, balancing frontend and backend development."
      }
    }
  },
  {
    "id": 4,
    "slug": "nursingcare",
    "title": "A nursing care management application for patient and employee administration",
    "tech": [
      "nextjs",
      "tailwindcss",
      "shadcn/ui",
      "axios",
      "momentjs",
      "NodeJS",
      "ExpressJS",
      "MongoDB",
      "Mongoose"
    ],
    "image": "/images/portfolio/nursing1.png",
    "banner_image": "/images/portfolio/nursing1.png",
    "client": "Personal Project",
    "categories": ["website"],
    "website": "https://nursingcare.vercel.app/",
    "login": {
      "admin": {
        "email": "sohaneftekhar@gmail.com",
        "password": "123456",
        "description": "Admin Login : https://nursingcare.vercel.app/auth/admin"
      },
      "employee": {
        "email": "employee3@gmail.com",
        "password": "123456",
        "description": "Employee Login : https://nursingcare.vercel.app/auth/admin"
      }
    },

    "details": {
      "description": "A comprehensive nursing care management platform that enables healthcare administrators to efficiently manage employees, patients, and care services. This production-ready application features a completely separate frontend and backend architecture, built with modern development practices. The system features robust user profile management, employee-patient assignment capabilities, booking and appointment scheduling, document management for medical papers, customizable care plan creation, and integrated form management. This streamlined solution helps nursing facilities improve their operational efficiency and deliver better patient care through organized administration.",
      "keyFeatures": {
        "features": [
          "<strong>User Profile Management:</strong> Comprehensive system for managing employee and patient profiles.",
          "<strong>Employee-Patient Assignment:</strong> Efficient assignment and tracking of care providers to patients.",
          "<strong>Booking & Scheduling:</strong> Appointment scheduling and management system.",
          "<strong>Document Management:</strong> Secure storage and handling of medical documents and papers.",
          "<strong>Care Plan Creation:</strong> Customizable care plans for individual patients.",
          "<strong>Form Management:</strong> Integrated system for managing medical and administrative forms."
        ],
        "image": ""
      },
      "technologyStack": [
        "<strong>Frontend:</strong> NextJS, TailwindCSS, Shadcn/UI, Axios, MomentJS, Zod (Separate Frontend Repository)",
        "<strong>Backend:</strong> NodeJS, ExpressJS, MongoDB, Mongoose (Separate Backend Repository)",
        "<strong>Architecture:</strong> Microservices architecture with separate frontend and backend deployments",
        "<strong>Production Ready:</strong> Fully deployed and production-ready application with live demo"
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Implementing dynamic form creation and location tracking features.",
          "solution": "Developed a flexible form builder system with custom validation and integrated real-time location services for accurate tracking and updates. Also implemented a robust appointment scheduling system with conflict detection."
        }
      ],
      "visuals": [
        "/images/portfolio/nursing2.png",
        "/images/portfolio/nursing3.png",
        "/images/portfolio/nursing4.png",
        "/images/portfolio/nursing5.png",
        "/images/portfolio/nursing6.png"
      ],
      "developmentInsights": {
        "whatILearned": "Gained extensive experience in full-stack development with separate frontend and backend architecture, backend optimization techniques and complex MongoDB database integration, including implementing efficient queries, indexing strategies, and handling complex data relationships. Learned to build production-ready applications with proper deployment strategies and microservices architecture.",
        "timeframe": "Completed in approximately 6 months, including testing and deployment.",
        "architecture": "Built with a complete separation of concerns - separate frontend and backend repositories with independent deployment pipelines, making it a truly production-ready application with scalable architecture."
      }
    }
  },
  {
    "id": 5,
    "slug": "social-media-app",
    "title": "Connect & Share: A social platform where users can create profiles, connect with friends, and exchange messages in real-time.",
    "tech": ["ReactJS", "Tailwind CSS", "Firebase", "Redux", "Firebase Auth"],
    "image": "/images/portfolio/mychat3.png",
    "banner_image": "/images/portfolio/mychat3.png",
    "client": "Practice Project",
    "categories": ["website", "frontend"],
    "github": "https://github.com/sohanthink/mychat",
    "website": "https://sohanschat.vercel.app/",
    "login": {
      "admin": {
        "email": "sohaneftekhar@gmail.com",
        "password": "123456",
        "description": "Admin access with full permissions"
      },
      "user": {
        "email": "user@demo.com",
        "password": "user123",
        "description": "Regular user account"
      }
    },
    "details": {
      "description": "This project is a social media application built with ReactJS, featuring real-time chatting capabilities. It includes user authentication, post creation, and a dynamic feed for user interactions. The app is designed to be responsive and utilizes Redux for state management.",
      "keyFeatures": {
        "features": [
          "<strong>User Authentication:</strong> Secure sign-up and login with form validation.",
          "<strong>Post Creation:</strong> Users can create, edit, and delete text-based or image-based posts.",
          "<strong>Feed & Interaction:</strong> A dynamic feed where users can post anything and view others' posts.",
          "<strong>State Management:</strong> Redux is used for efficient and predictable state management.",
          "<strong>Firebase Realtime Database:</strong> Real-time data synchronization for chat messages and posts."
        ],
        "image": "/images/portfolio/mychat.png"
      },
      "technologyStack": [
        "<strong>Frontend:</strong> React, Tailwind CSS, Redux",
        "<strong>Database:</strong> Firebase Realtime Database",
        "<strong>Tools & Libraries:</strong> Axios, React Router, Vite"
      ],
      "challengesAndSolutions": [
        {
          "challenge": "Building a real-time feed for seamless user interactions.",
          "solution": "Leveraged Redux for managing application state efficiently."
        },
        {
          "challenge": "Implementing real-time chatting features for single and group chats.",
          "solution": "Integrated Firebase Realtime Database to handle real-time messaging and used Redux to manage chat state efficiently."
        }
      ],
      "visuals": [
        "/images/portfolio/mychat2.png",
        "/images/portfolio/mychat1.png",
        "/images/portfolio/mychat3.png"
      ],
      "developmentInsights": {
        "whatILearned": "This project deepened my understanding of Redux, state management, real-time chatting, single or group messaging, and posting functionalities. I also improved my ability to design intuitive user interfaces.",
        "timeframe": "Completed in approximately 4 months, balancing frontend and Firebase development."
      }
    }
  }
]
